In [1]:
print("hello")

hello

In [2]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler,LabelEncoder
import pickle

In [3]:
data=pd.read_csv("data\churn_modelling.csv")
data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [4]:
data=data.drop('RowNumber',axis=1)

In [5]:
data.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [6]:
data=data.drop('CustomerId',axis=1)
data=data.drop('Surname',axis=1)

In [7]:
data.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [8]:
data.isnull().sum()

CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [9]:
label_encoder_gender=LabelEncoder()
data['Gender']=label_encoder_gender.fit_transform(data['Gender'])

In [10]:
data.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,0,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,0,41,1,83807.86,1,0,1,112542.58,0
2,502,France,0,42,8,159660.80,3,1,0,113931.57,1
3,699,France,0,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,0,43,2,125510.82,1,1,1,79084.10,0

In [11]:
from sklearn.preprocessing import OneHotEncoder

In [12]:
one_hot_encoder_geography=OneHotEncoder()
geo_sparse=one_hot_encoder_geography.fit_transform(data[['Geography']])
geo_sparse

<10000x3 sparse matrix of type '<class 'numpy.float64'>'
	with 10000 stored elements in Compressed Sparse Row format>

In [13]:
geo_encoded_df=pd.DataFrame(geo_sparse.toarray(),columns=one_hot_encoder_geography.get_feature_names_out(['Geography']))

In [14]:
geo_encoded_df

      Geography_France  Geography_Germany  Geography_Spain
0                  1.0                0.0              0.0
1                  0.0                0.0              1.0
2                  1.0                0.0              0.0
3                  1.0                0.0              0.0
4                  0.0                0.0              1.0
...                ...                ...              ...
9995               1.0                0.0              0.0
9996               1.0                0.0              0.0
9997               1.0                0.0              0.0
9998               0.0                1.0              0.0
9999               1.0                0.0              0.0

[10000 rows x 3 columns]

In [15]:
data=pd.concat([data.drop('Geography',axis=1),geo_encoded_df],axis=1)

In [16]:
data.head()

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain
0,619,0,42,2,0.00,1,1,1,101348.88,1,1.0,0.0,0.0
1,608,0,41,1,83807.86,1,0,1,112542.58,0,0.0,0.0,1.0
2,502,0,42,8,159660.80,3,1,0,113931.57,1,1.0,0.0,0.0
3,699,0,39,1,0.00,2,0,0,93826.63,0,1.0,0.0,0.0
4,850,0,43,2,125510.82,1,1,1,79084.10,0,0.0,0.0,1.0

In [17]:
with open('label_encoder_gender.pkl','wb') as file:
    pickle.dump(label_encoder_gender,file)

with open('onehot_encoder_geo.pkl','wb') as file:
    pickle.dump(one_hot_encoder_geography,file)

In [18]:
x=data.drop('Exited',axis=1)
y=data['Exited']

In [19]:
y

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [20]:
X_train,X_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [21]:
X_train.shape

(8000, 12)

In [22]:
y_train.shape

(8000,)

In [23]:
scale=StandardScaler()
X_train=scale.fit_transform(X_train)
X_test=scale.transform(X_test)

In [24]:
with open('scaler.pkl','wb') as file:
    pickle.dump(scale,file)

In [26]:
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense

In [27]:
from tensorflow.keras.callbacks import EarlyStopping,TensorBoard
import datetime

In [29]:
model=Sequential([
    Dense(64,activation='relu',input_shape=(X_train.shape[1],)),
    Dense(32,activation='relu'),
    Dense(1,activation='sigmoid')
])

In [30]:
model.summary()

Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 dense_1 (Dense)             (None, 64)                832

 dense_2 (Dense)             (None, 32)                2080

 dense_3 (Dense)             (None, 1)                 33

=================================================================
Total params: 2945 (11.50 KB)
Trainable params: 2945 (11.50 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

In [32]:
import tensorflow
opt=tensorflow.keras.optimizers.Adam(learning_rate=0.01)
loss=tensorflow.keras.losses.BinaryCrossentropy()

In [37]:
# compile the model

model.compile(optimizer=opt,loss="binary_crossentropy",metrics=['accuracy'])

In [38]:
## Set up the Tensorboard
from tensorflow.keras.callbacks import EarlyStopping,TensorBoard

log_dir="logs/fit/" + datetime.datetime.now().strftime("%Y%m%d-%H%M%S")
tensorflow_callback=TensorBoard(log_dir=log_dir,histogram_freq=1)

In [39]:
## Set up Early Stopping
early_stopping_callback=EarlyStopping(monitor='val_loss',patience=10,restore_best_weights=True)

In [40]:
history=model.fit(
    X_train,y_train,validation_data=(X_test,y_test),epochs=100,
    callbacks=[tensorflow_callback,early_stopping_callback]
)

Epoch 1/100
WARNING:tensorflow:From c:\Users\sehga\OneDrive\Desktop\ann project\.conda\lib\site-packages\keras\src\utils\tf_utils.py:492: The name tf.ragged.RaggedTensorValue is deprecated. Please use tf.compat.v1.ragged.RaggedTensorValue instead.

WARNING:tensorflow:From c:\Users\sehga\OneDrive\Desktop\ann project\.conda\lib\site-packages\keras\src\engine\base_layer_utils.py:384: The name tf.executing_eagerly_outside_functions is deprecated. Please use tf.compat.v1.executing_eagerly_outside_functions instead.

250/250 [==============================] - 3s 4ms/step - loss: 0.3932 - accuracy: 0.8321 - val_loss: 0.3507 - val_accuracy: 0.8565
Epoch 2/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3586 - accuracy: 0.8541 - val_loss: 0.3537 - val_accuracy: 0.8545
Epoch 3/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3513 - accuracy: 0.8575 - val_loss: 0.3414 - val_accuracy: 0.8610
Epoch 4/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3445 - accuracy: 0.8602 - val_loss: 0.3375 - val_accuracy: 0.8605
Epoch 5/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3411 - accuracy: 0.8589 - val_loss: 0.3502 - val_accuracy: 0.8580
Epoch 6/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3384 - accuracy: 0.8599 - val_loss: 0.3427 - val_accuracy: 0.8570
Epoch 7/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3367 - accuracy: 0.8625 - val_loss: 0.3569 - val_accuracy: 0.8535
Epoch 8/100
250/250 [==============================] - 0s 2ms/step - loss: 0.3354 - accuracy: 0.8620 - val_loss: 0.3414 - val_accuracy: 0.8600
Epoch 9/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3318 - accuracy: 0.8645 - val_loss: 0.3341 - val_accuracy: 0.8605
Epoch 10/100
250/250 [==============================] - 0s 2ms/step - loss: 0.3301 - accuracy: 0.8666 - val_loss: 0.3514 - val_accuracy: 0.8510
Epoch 11/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3288 - accuracy: 0.8676 - val_loss: 0.3521 - val_accuracy: 0.8560
Epoch 12/100
250/250 [==============================] - 0s 2ms/step - loss: 0.3265 - accuracy: 0.8685 - val_loss: 0.3448 - val_accuracy: 0.8565
Epoch 13/100
250/250 [==============================] - 0s 2ms/step - loss: 0.3253 - accuracy: 0.8661 - val_loss: 0.3369 - val_accuracy: 0.8625
Epoch 14/100
250/250 [==============================] - 0s 2ms/step - loss: 0.3211 - accuracy: 0.8696 - val_loss: 0.3492 - val_accuracy: 0.8575
Epoch 15/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3191 - accuracy: 0.8700 - val_loss: 0.3509 - val_accuracy: 0.8565
Epoch 16/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3168 - accuracy: 0.8721 - val_loss: 0.3568 - val_accuracy: 0.8545
Epoch 17/100
250/250 [==============================] - 1s 2ms/step - loss: 0.3154 - accuracy: 0.8709 - val_loss: 0.3496 - val_accuracy: 0.8540
Epoch 18/100
250/250 [==============================] - 0s 2ms/step - loss: 0.3109 - accuracy: 0.8759 - val_loss: 0.3477 - val_accuracy: 0.8565
Epoch 19/100
250/250 [==============================] - 0s 2ms/step - loss: 0.3098 - accuracy: 0.8745 - val_loss: 0.3600 - val_accuracy: 0.8545

In [41]:
model.save('model.h5')

c:\Users\sehga\OneDrive\Desktop\ann project\.conda\lib\site-packages\keras\src\engine\training.py:3103: UserWarning: You are saving your model as an HDF5 file via `model.save()`. This file format is considered legacy. We recommend using instead the native Keras format, e.g. `model.save('my_model.keras')`.
  saving_api.save_model(

In [42]:
## Load Tensorboard Extension
%load_ext tensorboard

In [50]:
%tensorboard --logdir logs/fit/20240715-134956

Reusing TensorBoard on port 6009 (pid 29012), started 0:00:06 ago. (Use '!kill 29012' to kill it.)

In [ ]:
# load the pickle file